Revit 2027 API
BuiltInFailures.DimensionFailures.WrongConstraintInSkeletonSketch Property
 Reference Lines can only be constrained to Reference Planes, Levels, Family Host, and other Reference Lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WrongConstraintInSkeletonSketch { get; }
Public Shared ReadOnly Property WrongConstraintInSkeletonSketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WrongConstraintInSkeletonSketch {
	FailureDefinitionId^ get ();
}
static member WrongConstraintInSkeletonSketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace